Revit 2026 API

# FailureDefinitionGetDefaultResolutionType Method

---

Retrieves the default resolution type for the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureResolutionType GetDefaultResolutionType()
```
```vb
Public Function GetDefaultResolutionType As FailureResolutionType
```
```cpp
public:
FailureResolutionType GetDefaultResolutionType()
```
```fsharp
member GetDefaultResolutionType : unit -> FailureResolutionType
```

#### Return Value

FailureResolutionType The Default resolution type for the failure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | FailureDefinition does not have any resolutions. |

#### Reference

FailureDefinition Class

Autodesk.Revit.DB Namespace